uhnp/src/InformationRegisters/НастройкиУчетаСтраховыхВзносов/НастройкиУчетаСтраховыхВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаСтраховыхВзносов</name>
  <resources>
    <name>ИспользуетсяТрудФармацевтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудЧленовЛетныхЭкипажей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудЧленовЭкипажейМорскихСудов</name>
    <comment>АПК:58</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудШахтеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуютсяРаботыВСельскомХозяйстве</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуютсяРаботыСДосрочнойПенсией</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяютсяЛьготныеТарифыВПодразделениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСамостоятельныеКлассификационныеЕдиницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудСтудентовСтуденческихОтрядов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудИностранцевСОсобымиВзносами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиДополнятьБазуРуководителя</name>
    <comment>АПК:58</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СтатусыЗастрахованныхФизическихЛиц/СтатусыЗастрахованныхФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗастрахованныхФизическихЛиц</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВидЗастрахованногоЛица</name>
    <type>
      <types>EnumRef.ВидыЗастрахованныхЛицОбязательногоСтрахования</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииИзменений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ВидыЗастрахованныхЛицОбязательногоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗастрахованныхЛицОбязательногоСтрахования</name>
  <enumValues>
    <name>ГражданеРФ</name>
  </enumValues>
  <enumValues>
    <name>ПостоянноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыПостоянноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыВременноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыПризнанныеБеженцами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыИзЕАЭС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСтрахуемыеФСС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСтрахуемыеНаОПС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыНестрахуемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыНестрахуемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтудентРаботающийВСтудотряде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/НастройкиУчетаСтраховыхВзносов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Начальное заполнение и обновление информационной базы.
Процедура ЗаполнитьФОПоказаТарифаВПодразделении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиУчетаСтраховыхВзносов.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
	|ГДЕ
	|	НастройкиУчетаСтраховыхВзносов.ПрименяютсяЛьготныеТарифыВПодразделениях <> (НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудЧленовЭкипажейМорскихСудов
	|			И НастройкиУчетаСтраховыхВзносов.Организация.ЕстьОбособленныеПодразделения)";
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат
	КонецЕсли; 

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаСтраховыхВзносов.Организация КАК Организация,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудФармацевтов КАК ИспользуетсяТрудФармацевтов,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудЧленовЛетныхЭкипажей КАК ИспользуетсяТрудЧленовЛетныхЭкипажей,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудЧленовЭкипажейМорскихСудов КАК ИспользуетсяТрудЧленовЭкипажейМорскихСудов,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудШахтеров КАК ИспользуетсяТрудШахтеров,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуютсяРаботыСДосрочнойПенсией КАК ИспользуютсяРаботыСДосрочнойПенсией,
	|	НастройкиУчетаСтраховыхВзносов.ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда КАК ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда,
	|	НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудЧленовЭкипажейМорскихСудов
	|		И НастройкиУчетаСтраховыхВзносов.Организация.ЕстьОбособленныеПодразделения КАК ПрименяютсяЛьготныеТарифыВПодразделениях,
	|	*
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов";
	
	НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
КонецПроцедуры

Процедура ЗаполнитьФОИспользованияИностранцевСОсобымиВзносами() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыЗастрахованныхФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИностранцы
	|ИЗ
	|	РегистрСведений.СтатусыЗастрахованныхФизическихЛиц КАК СтатусыЗастрахованныхФизическихЛиц
	|ГДЕ
	|	СтатусыЗастрахованныхФизическихЛиц.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС)";
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда
		Возврат
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ГоловнаяОрганизация КАК Организация
	|ПОМЕСТИТЬ ВТОрганизации
	|ИЗ
	|	ВТИностранцы КАК ФизическиеЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ФизическиеЛица.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
	|		ПО (НастройкиУчетаСтраховыхВзносов.Организация = Сотрудники.ГоловнаяОрганизация)
	|ГДЕ
	|	НЕ ЕСТЬNULL(НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудИностранцевСОсобымиВзносами, ЛОЖЬ)";
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда
		Возврат
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаСтраховыхВзносов.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Организации.Организация ЕСТЬ NULL
	|			ТОГДА НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудИностранцевСОсобымиВзносами
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользуетсяТрудИностранцевСОсобымиВзносами, 
	|	НастройкиУчетаСтраховыхВзносов.*
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОрганизации КАК Организации
	|		ПО НастройкиУчетаСтраховыхВзносов.Организация = Организации.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Организация,
	|	ИСТИНА, 
	|	НастройкиУчетаСтраховыхВзносов.*
	|ИЗ
	|	ВТОрганизации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
	|		ПО НастройкиУчетаСтраховыхВзносов.Организация = Организации.Организация
	|ГДЕ
	|	НастройкиУчетаСтраховыхВзносов.Организация ЕСТЬ NULL";
	
	НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
